Autodesk.Revit.DB.Structure.FabricSheet.BentFabricWiresOrientation
Specifies the location of the straight bars in the fabric sheet.
Remarks:
This property applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016